<style lang="less">
@import "../../../styles/tree-common.less";
@import "./templateManage.less";
</style>
<template>
<div>
<h1>配置使用说明</h1>
1.分值</br>
说明：参考分值配置项，配合计分类型、类型配置使用，不计分的情况选为0</br>
类型（文本）：分值(参考分) 计分类型：计分</br>
类型（单选）：分值(参考分) 计分类型：计分（配合选项内容使用如下）</br>
类型(选项内容)：选项分值   计分类型：不计分</br>
</br>
2.是否必填</br>
说明：根据模板选定的级别分为两种情况</br>
（1）一级模板配置：设置整个级别模板的（问题说明、问题照片），是否必填</br>
（2）其他评价项：设置每一个评分项是否必填（配合类型使用），是否必填</br>
</br>
3.计分类型</br>
说明：该项配置分为计分和不计分两种类型</br>
（1）计 分 ：有效的类型（单选、文本）</br>
（2）不计分：有效的类型（单选、文本、多选、日期、照片）</br>
</br>
4.类型</br>
说明：评价项的可用类型配置。主要配合计分类型使用，可以查阅计分类型说明（标题和选项内容除外）</br>
（1）文本类型：</br>
配置后小程序评分项为输入文本【查阅计分类型】</br>
（2）单选类型：</br>
配置后小程序评分项为单选类型（需要配置选项内容使用）【查阅计分类型】</br>
（3）多选类型：</br>
配置后小程序评分项为多选类型（需要配置选项内容使用）</br>
（4）选项内容：</br>
主要配合单选和多选类型使用，作为单选、多选模板的子集选项内容，如果上级是计分项是单选，需要填写分值，其他默认为0。</br>
（5）时间类型：</br>
配置后小程序评分项为时间选择控件</br>
（6）照片类型：</br>
配置后小程序评分项为照片上传控件</br>
（7）标题类型：</br>
模板中评分项的二级标题。满意度调查【评价表】->综合服务【标题】-> 2、物业值班电话畅通情况【评分项-单选】->满意（2 分）【选项内容】
    </div>
</template>

<script>
export default {
  name: "template-info",
  data() {
    return {
      loading: true,
      strict: true,
    }
  },
  methods: {
    init() {
       
    }
  },
  mounted() {
    // 计算高度
    let height = document.documentElement.clientHeight;
    this.maxHeight = Number(height - 287) + "px";
    this.init();
  }
};
</script>